package main

import (
	"fmt"
)

func main() {

	// คำถาม เราสามารถ สร้างตัวแปรขึ้นมาได้ 2 วิธีคือ var และ const
	var x string = "value1"
	y := 2
	const z string = "test"
	fmt.Println("value1:", x)
	fmt.Println("value2:", y)
	fmt.Println("value3:", z)

	// ค่าของ x หลังจากที่ run มีค่าเท่ากับเท่าไร?: xx := 5; xx += 1 หรือ xx++
	xx := 5
	xx++
	fmt.Println("xx มีค่าเท่ากับซ", xx)
	// out put xx=6

	// ขอบเขตคืออะไร และเราสามารถจะกําหนดขอบเขตของตัวแปรได้อย่างไร?
	// ขอบเขต คือ วงเล็บปีกา {} หรือ bracket
	// สามารถกำหนดขอบเขตตัวโดยการนำตัวแปร ไปใส่ใน bracket

	// var และ const แตกต่างกันอย่างไร?
	// var คือการประกาศตัวแปรเปลี่ยนแปลงค่าได้
	// const คือตัวแปรที่เป็นค่าคงที่ ไม่สามารถเปลี่ยนแปลงค่าได้

	// จงเขียนโปรแกรมที่แปลงค่าอุณหภูมิจาก Fahrenheit เป็น Celsius โดยเริ่มต้นจาก
	// (C = (F - 32) * 5/9)
	

}
